// ЗАДАЧА 00
// Напишите программу, которая на вход принимает два числа 
// и проверяет, является ли первое число квадратом второго. 

// Например: 
// a = 25, b = 5 --> да 
// a = 2, b = 10 --> нет 
// a = 9, b = -3 --> да 
// a = -3, b = 9 --> нет 


Console.Clear();
void Metod()
{
    System.Console.WriteLine(" ЗАДАЧА # 01 \n Напишите программу, которая на вход принимает два числа \n и проверяет, является ли первое число квадратом второго. \n Например: \n a = 25, b = 5 --> да \n a = 2, b = 10 --> нет \n a = 9, b = -3 --> да \n a = -3, b = 9 --> нет ");
}
Metod();